(function() {
	// =========================================================================
	//
	// 定数の定義
	//
	// =========================================================================

	// =========================================================================
	//
	// 外部モジュールのキャッシュ
	//
	// =========================================================================

	// =========================================================================
	//
	// コントローラの定義
	//
	// =========================================================================

	/**
	 * 検索コントローラ
	 *
	 * @class
	 * @name sample.GridViewerController
	 */
	var controller = {
		__name: 'sample.grid.GridWrapperController',

		//---------------------
		// 子コントローラ
		//---------------------
		_gridController: sample.grid.DatagridController,

		//---------------------
		// ロジック
		//---------------------

		//---------------------
		// メンバ
		//---------------------

		//---------------------
		// ライフサイクル
		//---------------------

		//---------------------
		// イベントハンドラ
		//---------------------
		'{window} resize': function() {
			this.refresh();
		},

		//---------------------
		// メソッド
		//---------------------
		/**
		 * @param {Array|Promise}
		 * @param {boolean} isMass グリッド動作確認用に大量ダミーデータかどうか
		 */
		setData: function(data, dummyColNums) {
			this._gridController.setData(data, dummyColNums);
		},

		filter: function(obj) {
			this._gridController.filter(obj);
		},

		/**
		 * グリッドコントローラの入れ替え
		 */
		setGridController: function(ctrl) {

		},

		refresh: function() {
			this._gridController.refresh();
		}
	};
	h5.core.expose(controller);
})(jQuery);
